<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"8a3421c2e2d074a6c61f212025e1b86522080c61f0442c09d575192713851c8e","plan_job_ref":"Job Terraform Plan #207 at https://github.com/cal-itp/data-infra/actions/runs/15288076515","plan_out_hash":"cfc99eda0190f47d62b1ab02f41804b3fa97bce3b1c66cfcb18aff68f1cf23c1","plan_hash":"3fc96141f42bb851c59c92432046af1d2b2ac146fb128fb80fc892ed12f25102","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __iac/cal-itp-data-infra/cdn/us__
<details>
<summary>Plan: 7 to add, 0 to change, 3 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # google_compute_global_forwarding_rule.calitp-http will be created
+   resource "google_compute_global_forwarding_rule" "calitp-http" {
+       base_forwarding_rule  = (known after apply)
+       effective_labels      = (known after apply)
+       forwarding_rule_id    = (known after apply)
+       id                    = (known after apply)
+       ip_address            = "projects/cal-itp-data-infra/global/addresses/static-load-balancer-address"
+       ip_protocol           = "TCP"
+       label_fingerprint     = (known after apply)
+       load_balancing_scheme = "EXTERNAL"
+       name                  = "calitp-http-forwarding-rule"
+       network               = (known after apply)
+       network_tier          = (known after apply)
+       port_range            = "80"
+       project               = "cal-itp-data-infra"
+       psc_connection_id     = (known after apply)
+       psc_connection_status = (known after apply)
+       self_link             = (known after apply)
+       subnetwork            = (known after apply)
+       target                = (known after apply)
+       terraform_labels      = (known after apply)

+       service_directory_registrations (known after apply)
    }

  # google_compute_global_forwarding_rule.calitp-https will be created
+   resource "google_compute_global_forwarding_rule" "calitp-https" {
+       base_forwarding_rule  = (known after apply)
+       effective_labels      = (known after apply)
+       forwarding_rule_id    = (known after apply)
+       id                    = (known after apply)
+       ip_address            = "projects/cal-itp-data-infra/global/addresses/static-load-balancer-address"
+       ip_protocol           = "TCP"
+       label_fingerprint     = (known after apply)
+       load_balancing_scheme = "EXTERNAL"
+       name                  = "calitp-https-forwarding-rule"
+       network               = (known after apply)
+       network_tier          = (known after apply)
+       port_range            = "443"
+       project               = "cal-itp-data-infra"
+       psc_connection_id     = (known after apply)
+       psc_connection_status = (known after apply)
+       self_link             = (known after apply)
+       subnetwork            = (known after apply)
+       target                = (known after apply)
+       terraform_labels      = (known after apply)

+       service_directory_registrations (known after apply)
    }

  # google_compute_global_forwarding_rule.default will be destroyed
  # (because google_compute_global_forwarding_rule.default is not in configuration)
-   resource "google_compute_global_forwarding_rule" "default" {
-       effective_labels      = {} -> null
-       forwarding_rule_id    = 5043396278496801537 -> null
-       id                    = "projects/cal-itp-data-infra/global/forwardingRules/http-lb-forwarding-rule" -> null
-       ip_address            = "34.8.18.200" -> null
-       ip_protocol           = "TCP" -> null
-       label_fingerprint     = "42WmSpB8rSM=" -> null
-       labels                = {} -> null
-       load_balancing_scheme = "EXTERNAL" -> null
-       name                  = "http-lb-forwarding-rule" -> null
-       network_tier          = "PREMIUM" -> null
-       port_range            = "80-80" -> null
-       project               = "cal-itp-data-infra" -> null
-       self_link             = "https://www.googleapis.com/compute/v1/projects/cal-itp-data-infra/global/forwardingRules/http-lb-forwarding-rule" -> null
-       source_ip_ranges      = [] -> null
-       target                = "https://www.googleapis.com/compute/v1/projects/cal-itp-data-infra/global/targetHttpProxies/http-lb-proxy" -> null
-       terraform_labels      = {} -> null
#        (7 unchanged attributes hidden)
    }

  # google_compute_managed_ssl_certificate.calitp will be created
+   resource "google_compute_managed_ssl_certificate" "calitp" {
+       certificate_id            = (known after apply)
+       creation_timestamp        = (known after apply)
+       expire_time               = (known after apply)
+       id                        = (known after apply)
+       name                      = "calitp-certificate"
+       project                   = "cal-itp-data-infra"
+       self_link                 = (known after apply)
+       subject_alternative_names = (known after apply)
+       type                      = "MANAGED"

+       managed {
+           domains = [
+               "dbt-docs.dds.dot.ca.gov.",
+               "gtfs.dds.dot.ca.gov.",
            ]
        }
    }

  # google_compute_target_http_proxy.calitp-http will be created
+   resource "google_compute_target_http_proxy" "calitp-http" {
+       creation_timestamp = (known after apply)
+       id                 = (known after apply)
+       name               = "calitp-http-proxy"
+       project            = "cal-itp-data-infra"
+       proxy_bind         = (known after apply)
+       proxy_id           = (known after apply)
+       self_link          = (known after apply)
+       url_map            = (known after apply)
    }

  # google_compute_target_http_proxy.default will be destroyed
  # (because google_compute_target_http_proxy.default is not in configuration)
-   resource "google_compute_target_http_proxy" "default" {
-       creation_timestamp          = "2025-04-11T14:47:14.895-07:00" -> null
-       http_keep_alive_timeout_sec = 0 -> null
-       id                          = "projects/cal-itp-data-infra/global/targetHttpProxies/http-lb-proxy" -> null
-       name                        = "http-lb-proxy" -> null
-       project                     = "cal-itp-data-infra" -> null
-       proxy_bind                  = false -> null
-       proxy_id                    = 3856786583723455245 -> null
-       self_link                   = "https://www.googleapis.com/compute/v1/projects/cal-itp-data-infra/global/targetHttpProxies/http-lb-proxy" -> null
-       url_map                     = "https://www.googleapis.com/compute/v1/projects/cal-itp-data-infra/global/urlMaps/http-lb" -> null
#        (1 unchanged attribute hidden)
    }

  # google_compute_target_https_proxy.calitp-https will be created
+   resource "google_compute_target_https_proxy" "calitp-https" {
+       creation_timestamp = (known after apply)
+       id                 = (known after apply)
+       name               = "calitp-https-proxy"
+       project            = "cal-itp-data-infra"
+       proxy_bind         = (known after apply)
+       proxy_id           = (known after apply)
+       quic_override      = "NONE"
+       self_link          = (known after apply)
+       ssl_certificates   = (known after apply)
+       tls_early_data     = (known after apply)
+       url_map            = (known after apply)
    }

  # google_compute_url_map.calitp-http will be created
+   resource "google_compute_url_map" "calitp-http" {
+       creation_timestamp = (known after apply)
+       fingerprint        = (known after apply)
+       id                 = (known after apply)
+       map_id             = (known after apply)
+       name               = "calitp-http-load-balancer"
+       project            = "cal-itp-data-infra"
+       self_link          = (known after apply)

+       default_url_redirect {
+           https_redirect = true
+           strip_query    = false
        }
    }

  # google_compute_url_map.calitp-https will be created
+   resource "google_compute_url_map" "calitp-https" {
+       creation_timestamp = (known after apply)
+       default_service    = "projects/cal-itp-data-infra/global/backendBuckets/calitp-dbt-docs-backend-bucket"
+       fingerprint        = (known after apply)
+       id                 = (known after apply)
+       map_id             = (known after apply)
+       name               = "calitp-https-load-balancer"
+       project            = "cal-itp-data-infra"
+       self_link          = (known after apply)

+       host_rule {
+           hosts        = [
+               "dbt-docs.dds.dot.ca.gov",
            ]
+           path_matcher = "dbt-docs"
#            (1 unchanged attribute hidden)
        }
+       host_rule {
+           hosts        = [
+               "gtfs.dds.dot.ca.gov",
            ]
+           path_matcher = "gtfs"
#            (1 unchanged attribute hidden)
        }

+       path_matcher {
+           default_service = "projects/cal-itp-data-infra/global/backendBuckets/calitp-gtfs-backend-bucket"
+           name            = "gtfs"

+           path_rule {
+               paths   = [
+                   "/*",
                ]
+               service = "projects/cal-itp-data-infra/global/backendBuckets/calitp-gtfs-backend-bucket"
            }
        }
+       path_matcher {
+           default_service = "projects/cal-itp-data-infra/global/backendBuckets/calitp-dbt-docs-backend-bucket"
+           name            = "dbt-docs"

+           path_rule {
+               paths   = [
+                   "/*",
                ]
+               service = "projects/cal-itp-data-infra/global/backendBuckets/calitp-dbt-docs-backend-bucket"
            }
        }
    }

  # google_compute_url_map.default will be destroyed
  # (because google_compute_url_map.default is not in configuration)
-   resource "google_compute_url_map" "default" {
-       creation_timestamp = "2025-04-11T14:47:03.245-07:00" -> null
-       default_service    = "https://www.googleapis.com/compute/v1/projects/cal-itp-data-infra/global/backendBuckets/calitp-gtfs-backend-bucket" -> null
-       fingerprint        = "bNr75_Kh4qw=" -> null
-       id                 = "projects/cal-itp-data-infra/global/urlMaps/http-lb" -> null
-       map_id             = 476288992649950008 -> null
-       name               = "http-lb" -> null
-       project            = "cal-itp-data-infra" -> null
-       self_link          = "https://www.googleapis.com/compute/v1/projects/cal-itp-data-infra/global/urlMaps/http-lb" -> null
#        (1 unchanged attribute hidden)

-       host_rule {
-           hosts        = [
-               "dbt-docs.dds.dot.ca.gov",
            ] -> null
-           path_matcher = "dbt-docs" -> null
#            (1 unchanged attribute hidden)
        }
-       host_rule {
-           hosts        = [
-               "gtfs.dds.dot.ca.gov",
            ] -> null
-           path_matcher = "gtfs" -> null
#            (1 unchanged attribute hidden)
        }

-       path_matcher {
-           default_service = "https://www.googleapis.com/compute/v1/projects/cal-itp-data-infra/global/backendBuckets/calitp-gtfs-backend-bucket" -> null
-           name            = "gtfs" -> null
#            (1 unchanged attribute hidden)
        }
-       path_matcher {
-           default_service = "https://www.googleapis.com/compute/v1/projects/cal-itp-data-infra/global/backendBuckets/calitp-dbt-docs-backend-bucket" -> null
-           name            = "dbt-docs" -> null
#            (1 unchanged attribute hidden)
        }
    }

Plan: 7 to add, 0 to change, 3 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #207](https://github.com/cal-itp/data-infra/actions/runs/15288076515)